app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-07-15 22:17:11.934847"], ["email", "new@new.com"], ["password", "test"], ["updated_at", "2014-07-15 22:17:11.934847"], ["username", "ReidC"]]